app/controllers/contents_controller.rb

SELECT * FROM "contents"
---
  def index
    @contents = Content.all

SELECT * FROM "contents" WHERE ("contents"."id" = 3)
---
  def show
    @content = Content.find(params[:id])

SELECT * FROM "sections" WHERE ("sections"."id" = '1') LIMIT 1
INSERT INTO "contents" ("created_at", "title", "body", "image_url", "excerpt", "updated_at") VALUES('2010-05-02 16:06:55', 'Begin at the beginning and go on till you come to the end; then stop', 'Begin at the beginning and go on till you come to the end; then stop. ~Lewis Carrol, Alice in Wonderland', '', '', '2010-05-02 16:06:55')
---
  def create
    @content = Content.new(params[:content])
    section = Section.find_by_id(params[:section_id])
    @content.sections << section

SELECT * FROM "contents" WHERE ("contents"."id" = 9)
DELETE FROM "contents" WHERE "id" = 9
---
  def destroy
    @content = Content.find(params[:id])
    @content.destroy